## timing contstraints


set_input_delay   1.2  [get_ports {A[5]}]
set_input_delay   1.2  [get_ports {A[4]}]
set_input_delay   1.2  [get_ports {A[3]}]
set_input_delay   1.2  [get_ports {A[2]}]
set_input_delay   1.2  [get_ports {A[1]}]
set_input_delay   1.2  [get_ports {A[0]}]

set_output_delay  1.2  [get_ports {Y[63]}]
set_output_delay  1.2  [get_ports {Y[62]}]
set_output_delay  1.2  [get_ports {Y[61]}]
set_output_delay  1.2  [get_ports {Y[60]}]
set_output_delay  1.2  [get_ports {Y[59]}]
set_output_delay  1.2  [get_ports {Y[58]}]
set_output_delay  1.2  [get_ports {Y[57]}]
set_output_delay  1.2  [get_ports {Y[56]}]
set_output_delay  1.2  [get_ports {Y[55]}]
set_output_delay  1.2  [get_ports {Y[54]}]
set_output_delay  1.2  [get_ports {Y[53]}]
set_output_delay  1.2  [get_ports {Y[52]}]
set_output_delay  1.2  [get_ports {Y[51]}]
set_output_delay  1.2  [get_ports {Y[50]}]
set_output_delay  1.2  [get_ports {Y[49]}]
set_output_delay  1.2  [get_ports {Y[48]}]
set_output_delay  1.2  [get_ports {Y[47]}]
set_output_delay  1.2  [get_ports {Y[46]}]
set_output_delay  1.2  [get_ports {Y[45]}]
set_output_delay  1.2  [get_ports {Y[44]}]
set_output_delay  1.2  [get_ports {Y[43]}]
set_output_delay  1.2  [get_ports {Y[42]}]
set_output_delay  1.2  [get_ports {Y[41]}]
set_output_delay  1.2  [get_ports {Y[40]}]
set_output_delay  1.2  [get_ports {Y[39]}]
set_output_delay  1.2  [get_ports {Y[38]}]
set_output_delay  1.2  [get_ports {Y[37]}]
set_output_delay  1.2  [get_ports {Y[36]}]
set_output_delay  1.2  [get_ports {Y[35]}]
set_output_delay  1.2  [get_ports {Y[34]}]
set_output_delay  1.2  [get_ports {Y[33]}]
set_output_delay  1.2  [get_ports {Y[32]}]
set_output_delay  1.2  [get_ports {Y[31]}]
set_output_delay  1.2  [get_ports {Y[30]}]
set_output_delay  1.2  [get_ports {Y[29]}]
set_output_delay  1.2  [get_ports {Y[28]}]
set_output_delay  1.2  [get_ports {Y[27]}]
set_output_delay  1.2  [get_ports {Y[26]}]
set_output_delay  1.2  [get_ports {Y[25]}]
set_output_delay  1.2  [get_ports {Y[24]}]
set_output_delay  1.2  [get_ports {Y[23]}]
set_output_delay  1.2  [get_ports {Y[22]}]
set_output_delay  1.2  [get_ports {Y[21]}]
set_output_delay  1.2  [get_ports {Y[20]}]
set_output_delay  1.2  [get_ports {Y[19]}]
set_output_delay  1.2  [get_ports {Y[18]}]
set_output_delay  1.2  [get_ports {Y[17]}]
set_output_delay  1.2  [get_ports {Y[16]}]
set_output_delay  1.2  [get_ports {Y[15]}]
set_output_delay  1.2  [get_ports {Y[14]}]
set_output_delay  1.2  [get_ports {Y[13]}]
set_output_delay  1.2  [get_ports {Y[12]}]
set_output_delay  1.2  [get_ports {Y[11]}]
set_output_delay  1.2  [get_ports {Y[10]}]
set_output_delay  1.2  [get_ports {Y[9]}]
set_output_delay  1.2  [get_ports {Y[8]}]
set_output_delay  1.2  [get_ports {Y[7]}]
set_output_delay  1.2  [get_ports {Y[6]}]
set_output_delay  1.2  [get_ports {Y[5]}]
set_output_delay  1.2  [get_ports {Y[4]}]
set_output_delay  1.2  [get_ports {Y[3]}]
set_output_delay  1.2  [get_ports {Y[2]}]
set_output_delay  1.2  [get_ports {Y[1]}]
set_output_delay  1.2  [get_ports {Y[0]}]


#set_driving_cell -lib_cell SAEDRVT14_BUF_10 -pin X [get_ports {en A}]
#set_driving_cell -lib_cell SAEDRVT14_FDPRBQ_V2_0P5 -pin Q [get_ports {Y}]


set_load -pin_load 0.004 [get_ports {Y[63]}]
set_load -pin_load 0.004 [get_ports {Y[62]}]
set_load -pin_load 0.004 [get_ports {Y[61]}]
set_load -pin_load 0.004 [get_ports {Y[60]}]
set_load -pin_load 0.004 [get_ports {Y[59]}]
set_load -pin_load 0.004 [get_ports {Y[58]}]
set_load -pin_load 0.004 [get_ports {Y[57]}]
set_load -pin_load 0.004 [get_ports {Y[56]}]
set_load -pin_load 0.004 [get_ports {Y[55]}]
set_load -pin_load 0.004 [get_ports {Y[54]}]
set_load -pin_load 0.004 [get_ports {Y[53]}]
set_load -pin_load 0.004 [get_ports {Y[52]}]
set_load -pin_load 0.004 [get_ports {Y[51]}]
set_load -pin_load 0.004 [get_ports {Y[50]}]
set_load -pin_load 0.004 [get_ports {Y[49]}]
set_load -pin_load 0.004 [get_ports {Y[48]}]
set_load -pin_load 0.004 [get_ports {Y[47]}]
set_load -pin_load 0.004 [get_ports {Y[46]}]
set_load -pin_load 0.004 [get_ports {Y[45]}]
set_load -pin_load 0.004 [get_ports {Y[44]}]
set_load -pin_load 0.004 [get_ports {Y[43]}]
set_load -pin_load 0.004 [get_ports {Y[42]}]
set_load -pin_load 0.004 [get_ports {Y[41]}]
set_load -pin_load 0.004 [get_ports {Y[40]}]
set_load -pin_load 0.004 [get_ports {Y[39]}]
set_load -pin_load 0.004 [get_ports {Y[38]}]
set_load -pin_load 0.004 [get_ports {Y[37]}]
set_load -pin_load 0.004 [get_ports {Y[36]}]
set_load -pin_load 0.004 [get_ports {Y[35]}]
set_load -pin_load 0.004 [get_ports {Y[34]}]
set_load -pin_load 0.004 [get_ports {Y[33]}]
set_load -pin_load 0.004 [get_ports {Y[32]}]
set_load -pin_load 0.004 [get_ports {Y[31]}]
set_load -pin_load 0.004 [get_ports {Y[30]}]
set_load -pin_load 0.004 [get_ports {Y[29]}]
set_load -pin_load 0.004 [get_ports {Y[28]}]
set_load -pin_load 0.004 [get_ports {Y[27]}]
set_load -pin_load 0.004 [get_ports {Y[26]}]
set_load -pin_load 0.004 [get_ports {Y[25]}]
set_load -pin_load 0.004 [get_ports {Y[24]}]
set_load -pin_load 0.004 [get_ports {Y[23]}]
set_load -pin_load 0.004 [get_ports {Y[22]}]
set_load -pin_load 0.004 [get_ports {Y[21]}]
set_load -pin_load 0.004 [get_ports {Y[20]}]
set_load -pin_load 0.004 [get_ports {Y[19]}]
set_load -pin_load 0.004 [get_ports {Y[18]}]
set_load -pin_load 0.004 [get_ports {Y[17]}]
set_load -pin_load 0.004 [get_ports {Y[16]}]
set_load -pin_load 0.004 [get_ports {Y[15]}]
set_load -pin_load 0.004 [get_ports {Y[14]}]
set_load -pin_load 0.004 [get_ports {Y[13]}]
set_load -pin_load 0.004 [get_ports {Y[12]}]
set_load -pin_load 0.004 [get_ports {Y[11]}]
set_load -pin_load 0.004 [get_ports {Y[10]}]
set_load -pin_load 0.004 [get_ports {Y[9]}]
set_load -pin_load 0.004 [get_ports {Y[8]}]
set_load -pin_load 0.004 [get_ports {Y[7]}]
set_load -pin_load 0.004 [get_ports {Y[6]}]
set_load -pin_load 0.004 [get_ports {Y[5]}]
set_load -pin_load 0.004 [get_ports {Y[4]}]
set_load -pin_load 0.004 [get_ports {Y[3]}]
set_load -pin_load 0.004 [get_ports {Y[2]}]
set_load -pin_load 0.004 [get_ports {Y[1]}]
set_load -pin_load 0.004 [get_ports {Y[0]}]

